** Basic Settings
Hit S for Spam
#+BEGIN_SRC emacs-lisp :tangle lisp/mail.el
(define-key notmuch-show-mode-map "S"
  (lambda ()
    "mark message as spam"
    (interactive)
    (notmuch-show-tag (list "+junk" "-inbox" "-unread"))
    (notmuch-tree-next-matching-message)
    ))
#+END_SRC
Hit T for TODO
#+BEGIN_SRC emacs-lisp :tangle lisp/mail.el
(define-key notmuch-show-mode-map "T"
  (lambda ()
    "mark message as todo"
    (interactive)
    (notmuch-show-tag (list "+todo" "-inbox" "-unread"))
    (notmuch-tree-next-matching-message)
    ))
#+END_SRC
HTML mail
#+BEGIN_SRC emacs-lisp :tangle lisp/mail.el
(setq mm-text-html-renderer 'gnus-w3m)
(setq gnus-html-frame-width 180)
#+END_SRC
Who am I?
#+BEGIN_SRC emacs-lisp :tangle lisp/mail.el
(setq user-mail-address "vladg@illinois.edu")
(setq user-full-name "Vlad Grigorescu")
#+END_SRC
Send/receive mail
#+BEGIN_SRC emacs-lisp :tangle lisp/mail.el
(setq message-send-mail-function 'message-send-mail-with-sendmail
      sendmail-program "/usr/local/bin/msmtp")
(setq mu4e-maildir "~/Mail")
(setq send-mail-function "smtpmail-send-it")
(setq smtpmail-smtp-server "smtp.illinois.edu")
(setq smtpmail-smtp-service 587)
#+END_SRC

#+RESULTS:
: 587

Order
#+BEGIN_SRC emacs-lisp :tangle lisp/mail.el
(setq notmuch-search-oldest-first nil)
#+END_SRC
